Show / Hide Table of Contents
Class ResultInSection
Common result
Inheritance
System.Object
ResultInSection
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultInSection
Properties
Improve this Doc   View Source
Position
Position
Declaration
public double Position { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ResultOfLoading
Result In Section
Declaration
public List<ResultOfLoading2> ResultOfLoading { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ResultOfLoading2>
 Improve this Doc
 View Source